<?php
/**
 * 各种配置
 */

return [

	'比赛名称'=>'2015年昆山市中小学生航空模型比赛',

	'模板'=>[
		'裁判用表'	=>	utf8ToGbk(base_path().'/模板/2015昆山航模/裁判用表.xls'),
		'分组情况'	=>	utf8ToGbk(base_path().'/模板/2015昆山航模/分组情况.xlsx'),
		'检录用表'	=>	utf8ToGbk(base_path().'/模板/2015昆山航模/检录.xlsx'),
		'成绩录入'	=>	utf8ToGbk(base_path().'/模板/2015昆山航模/成绩录入.xlsx'),
//		'成绩册'		=>	utf8ToGbk(base_path().'/模板/2015昆山航模/成绩册模板测试.xlsx'),
		'成绩册'		=>	utf8ToGbk(base_path().'/模板/2015昆山航模/成绩册模板.xlsx'),
		'获奖名单_打印'		=>	utf8ToGbk(base_path().'/模板/2015昆山航模/获奖名单_打印.xlsx'),
	],

	'项目'=>[
		'P1B-1橡筋动力模型飞机留空计时赛'=>[
			'表名'=>'A1,橡筋',
			'组别'=>['小学','中学',],
			'首条数据行号'=>2,
			'分组'=>[
				'方式'=>'区域/固定数量', //可取值：固定数量、区域/固定数量
				'区域'=>['1号位','2号位','3号位', '4号位', '5号位', '6号位', '7号位', '8号位', '9号位', '10号位'],
				'组名'=>'[X]组',
				'每组人数'=>6,
			],//分组
			'按行数分页'=>10  //每N条数据分一页
		],//单个项目

		'带降模型火箭留空计时赛'=>[
			'表名'=>'A2,火箭',
			'组别'=>['小学','中学'],
			'首条数据行号'=>2,
			'分组'=>[
				'方式'=>'区域/固定数量', //可取值：固定数量、区域/固定数量
				'区域'=>['1号位','2号位','3号位', '4号位', '5号位', '6号位', '7号位', '8号位', '9号位', '10号位'],
				'组名'=>'[X]组',
				'每组人数'=>6,
			],//分组
			'按行数分页'=>6  //每N条数据分一页
		],//单个项目

		'遥控电动模型直升机特技赛'=>[
			'表名'=>'B1,遥控',
			'组别'=>['小学','中学'],
			'首条数据行号'=>3,
			'分组'=>[
				'方式'=>'区域/固定数量', //可取值：固定数量、区域/固定数量
				'区域'=>['1号位','2号位','3号位'],
				'组名'=>'[X]组',
				'每组人数'=>6,
			],//分组
			'按行数分页'=>6  //每N条数据分一页
		],//单个项目

		'手掷飞机三人接力团体赛'=>[
			'表名'=>'C1,接力',
			'组别'=>['小学','中学'],
			'首条数据行号'=>2,
			'分组'=>[
				'方式'=>'区域/固定数量', //可取值：固定数量、区域/固定数量
				'区域'=>['1号位','2号位','3号位', '4号位', '5号位'],
				'组名'=>'[X]组',
				'每组人数'=>3,
			],//分组
			'按行数分页'=>3  //每N条数据分一页
		],//单个项目


	],//项目

	'计算成绩' => [
		'综合团体'=> [
			'表名'=>'综合团体',//excel成绩册模板中的表名
			'奖项比例'=>['一等奖'=>'0.1', '二等奖'=>'0.2', '三等奖'=>'0.3' ],
		],
		'优秀辅导员' => [
			'表名'=>'优秀辅导员',
		]
	],

	'生成路径'=>utf8ToGbk('d:/生成'),
];